__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 256, 256, 3) 0
__________________________________________________________________________________________________
conv1a (Conv2D)                 (None, 256, 256, 32) 864         input_1[0][0]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 256, 256, 32) 128         conv1a[0][0]
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 256, 256, 32) 0           batch_normalization[0][0]
__________________________________________________________________________________________________
conv1b (Conv2D)                 (None, 256, 256, 32) 96          input_1[0][0]
__________________________________________________________________________________________________
conv1c (Conv2D)                 (None, 256, 256, 32) 9216        leaky_re_lu[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 256, 256, 32) 128         conv1b[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 256, 256, 32) 128         conv1c[0][0]
__________________________________________________________________________________________________
add (Add)                       (None, 256, 256, 32) 0           batch_normalization_2[0][0]
                                                                 batch_normalization_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 256, 256, 32) 0           add[0][0]
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 128, 128, 32) 0           leaky_re_lu_1[0][0]
__________________________________________________________________________________________________
conv2a (Conv2D)                 (None, 128, 128, 64) 18432       max_pooling2d[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 128, 128, 64) 256         conv2a[0][0]
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 128, 128, 64) 0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
conv2b (Conv2D)                 (None, 128, 128, 64) 2048        max_pooling2d[0][0]
__________________________________________________________________________________________________
conv2c (Conv2D)                 (None, 128, 128, 64) 36864       leaky_re_lu_2[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 128, 128, 64) 256         conv2b[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128, 128, 64) 256         conv2c[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 128, 128, 64) 0           batch_normalization_5[0][0]
                                                                 batch_normalization_4[0][0]
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 128, 128, 64) 0           add_1[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 64, 64, 64)   0           leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
conv3a (Conv2D)                 (None, 64, 64, 128)  73728       max_pooling2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 64, 64, 128)  512         conv3a[0][0]
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 64, 64, 128)  0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
conv3b (Conv2D)                 (None, 64, 64, 128)  8192        max_pooling2d_1[0][0]
__________________________________________________________________________________________________
conv3c (Conv2D)                 (None, 64, 64, 128)  147456      leaky_re_lu_4[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64, 64, 128)  512         conv3b[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 64, 64, 128)  512         conv3c[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 64, 64, 128)  0           batch_normalization_8[0][0]
                                                                 batch_normalization_7[0][0]
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 64, 64, 128)  0           add_2[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 32, 32, 128)  0           leaky_re_lu_5[0][0]
__________________________________________________________________________________________________
conv4a (Conv2D)                 (None, 32, 32, 256)  294912      max_pooling2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 32, 32, 256)  1024        conv4a[0][0]
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 32, 32, 256)  0           batch_normalization_9[0][0]
__________________________________________________________________________________________________
conv4b (Conv2D)                 (None, 32, 32, 256)  32768       max_pooling2d_2[0][0]
__________________________________________________________________________________________________
conv4c (Conv2D)                 (None, 32, 32, 256)  589824      leaky_re_lu_6[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 32, 32, 256)  1024        conv4b[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 32, 32, 256)  1024        conv4c[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 256)  0           batch_normalization_11[0][0]
                                                                 batch_normalization_10[0][0]
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 32, 32, 256)  0           add_3[0][0]
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 16, 16, 256)  0           leaky_re_lu_7[0][0]
__________________________________________________________________________________________________
conv5a (Conv2D)                 (None, 16, 16, 512)  1179648     max_pooling2d_3[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 16, 512)  2048        conv5a[0][0]
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 16, 16, 512)  0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
conv5b (Conv2D)                 (None, 16, 16, 512)  131072      max_pooling2d_3[0][0]
__________________________________________________________________________________________________
conv5c (Conv2D)                 (None, 16, 16, 512)  2359296     leaky_re_lu_8[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 16, 16, 512)  2048        conv5b[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 16, 512)  2048        conv5c[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 16, 512)  0           batch_normalization_14[0][0]
                                                                 batch_normalization_13[0][0]
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 16, 16, 512)  0           add_4[0][0]
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 8, 8, 512)    0           leaky_re_lu_9[0][0]
__________________________________________________________________________________________________
conv6a (Conv2D)                 (None, 8, 8, 1024)   4718592     max_pooling2d_4[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 8, 8, 1024)   4096        conv6a[0][0]
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 8, 8, 1024)   0           batch_normalization_15[0][0]
__________________________________________________________________________________________________
conv6b (Conv2D)                 (None, 8, 8, 1024)   524288      max_pooling2d_4[0][0]
__________________________________________________________________________________________________
conv6c (Conv2D)                 (None, 8, 8, 1024)   9437184     leaky_re_lu_10[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 8, 8, 1024)   4096        conv6b[0][0]
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 8, 8, 1024)   4096        conv6c[0][0]
__________________________________________________________________________________________________
add_5 (Add)                     (None, 8, 8, 1024)   0           batch_normalization_17[0][0]
                                                                 batch_normalization_16[0][0]
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 8, 8, 1024)   0           add_5[0][0]
__________________________________________________________________________________________________
gating_num1 (Conv2D)            (None, 8, 8, 512)    524288      leaky_re_lu_11[0][0]
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 8, 8, 512)    2048        gating_num1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 8, 8, 512)    0           batch_normalization_18[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 8, 8, 512)    262656      leaky_re_lu_12[0][0]
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 8, 8, 512)    2359808     conv2d_1[0][0]
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 8, 8, 512)    1049088     leaky_re_lu_9[0][0]
__________________________________________________________________________________________________
add_6 (Add)                     (None, 8, 8, 512)    0           conv2d_transpose[0][0]
                                                                 conv2d[0][0]
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 8, 8, 512)    0           add_6[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 8, 8, 1)      513         leaky_re_lu_13[0][0]
__________________________________________________________________________________________________
activation (Activation)         (None, 8, 8, 1)      0           conv2d_2[0][0]
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 16, 16, 1)    0           activation[0][0]
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 16, 16, 512)  0           up_sampling2d[0][0]
__________________________________________________________________________________________________
multiply (Multiply)             (None, 16, 16, 512)  0           lambda[0][0]
                                                                 leaky_re_lu_9[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 16, 16, 512)  262656      multiply[0][0]
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 16, 16, 1024) 0           leaky_re_lu_11[0][0]
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 16, 16, 512)  2048        conv2d_3[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 16, 16, 1536) 0           up_sampling2d_1[0][0]
                                                                 batch_normalization_19[0][0]
__________________________________________________________________________________________________
conv7a (Conv2D)                 (None, 16, 16, 512)  7077888     concatenate[0][0]
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 16, 16, 512)  2048        conv7a[0][0]
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 16, 16, 512)  0           batch_normalization_20[0][0]
__________________________________________________________________________________________________
conv7b (Conv2D)                 (None, 16, 16, 512)  786432      concatenate[0][0]
__________________________________________________________________________________________________
conv7c (Conv2D)                 (None, 16, 16, 512)  2359296     leaky_re_lu_14[0][0]
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 16, 16, 512)  2048        conv7b[0][0]
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 16, 16, 512)  2048        conv7c[0][0]
__________________________________________________________________________________________________
add_7 (Add)                     (None, 16, 16, 512)  0           batch_normalization_22[0][0]
                                                                 batch_normalization_21[0][0]
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 16, 16, 512)  0           add_7[0][0]
__________________________________________________________________________________________________
gating_num2 (Conv2D)            (None, 16, 16, 256)  131072      leaky_re_lu_15[0][0]
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 16, 16, 256)  1024        gating_num2[0][0]
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 16, 16, 256)  0           batch_normalization_23[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 16, 16, 256)  65792       leaky_re_lu_16[0][0]
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 16, 16, 256)  590080      conv2d_5[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 16, 16, 256)  262400      leaky_re_lu_7[0][0]
__________________________________________________________________________________________________
add_8 (Add)                     (None, 16, 16, 256)  0           conv2d_transpose_1[0][0]
                                                                 conv2d_4[0][0]
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 16, 16, 256)  0           add_8[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 16, 16, 1)    257         leaky_re_lu_17[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 16, 16, 1)    0           conv2d_6[0][0]
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 32, 32, 1)    0           activation_1[0][0]
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 32, 32, 256)  0           up_sampling2d_2[0][0]
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 32, 32, 256)  0           lambda_1[0][0]
                                                                 leaky_re_lu_7[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 256)  65792       multiply_1[0][0]
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 32, 32, 512)  0           leaky_re_lu_15[0][0]
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 32, 32, 256)  1024        conv2d_7[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 768)  0           up_sampling2d_3[0][0]
                                                                 batch_normalization_24[0][0]
__________________________________________________________________________________________________
conv8a (Conv2D)                 (None, 32, 32, 256)  1769472     concatenate_1[0][0]
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 32, 32, 256)  1024        conv8a[0][0]
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 32, 32, 256)  0           batch_normalization_25[0][0]
__________________________________________________________________________________________________
conv8b (Conv2D)                 (None, 32, 32, 256)  196608      concatenate_1[0][0]
__________________________________________________________________________________________________
conv8c (Conv2D)                 (None, 32, 32, 256)  589824      leaky_re_lu_18[0][0]
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 32, 32, 256)  1024        conv8b[0][0]
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 32, 32, 256)  1024        conv8c[0][0]
__________________________________________________________________________________________________
add_9 (Add)                     (None, 32, 32, 256)  0           batch_normalization_27[0][0]
                                                                 batch_normalization_26[0][0]
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 32, 32, 256)  0           add_9[0][0]
__________________________________________________________________________________________________
gating_num3 (Conv2D)            (None, 32, 32, 128)  32768       leaky_re_lu_19[0][0]
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 32, 32, 128)  512         gating_num3[0][0]
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 32, 32, 128)  0           batch_normalization_28[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 128)  16512       leaky_re_lu_20[0][0]
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 32, 32, 128)  147584      conv2d_9[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 128)  65664       leaky_re_lu_5[0][0]
__________________________________________________________________________________________________
add_10 (Add)                    (None, 32, 32, 128)  0           conv2d_transpose_2[0][0]
                                                                 conv2d_8[0][0]
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 32, 32, 128)  0           add_10[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 1)    129         leaky_re_lu_21[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 1)    0           conv2d_10[0][0]
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 64, 64, 1)    0           activation_2[0][0]
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 64, 64, 128)  0           up_sampling2d_4[0][0]
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 64, 64, 128)  0           lambda_2[0][0]
                                                                 leaky_re_lu_5[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 64, 64, 128)  16512       multiply_2[0][0]
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, 64, 64, 256)  0           leaky_re_lu_19[0][0]
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 64, 64, 128)  512         conv2d_11[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64, 64, 384)  0           up_sampling2d_5[0][0]
                                                                 batch_normalization_29[0][0]
__________________________________________________________________________________________________
conv9a (Conv2D)                 (None, 64, 64, 128)  442368      concatenate_2[0][0]
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 64, 64, 128)  512         conv9a[0][0]
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 64, 64, 128)  0           batch_normalization_30[0][0]
__________________________________________________________________________________________________
conv9b (Conv2D)                 (None, 64, 64, 128)  49152       concatenate_2[0][0]
__________________________________________________________________________________________________
conv9c (Conv2D)                 (None, 64, 64, 128)  147456      leaky_re_lu_22[0][0]
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 64, 64, 128)  512         conv9b[0][0]
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 64, 64, 128)  512         conv9c[0][0]
__________________________________________________________________________________________________
add_11 (Add)                    (None, 64, 64, 128)  0           batch_normalization_32[0][0]
                                                                 batch_normalization_31[0][0]
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 64, 64, 128)  0           add_11[0][0]
__________________________________________________________________________________________________
gating_num4 (Conv2D)            (None, 64, 64, 64)   8192        leaky_re_lu_23[0][0]
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 64, 64, 64)   256         gating_num4[0][0]
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 64, 64, 64)   0           batch_normalization_33[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 64, 64, 64)   4160        leaky_re_lu_24[0][0]
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 64, 64, 64)   36928       conv2d_13[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 64, 64, 64)   16448       leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
add_12 (Add)                    (None, 64, 64, 64)   0           conv2d_transpose_3[0][0]
                                                                 conv2d_12[0][0]
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (None, 64, 64, 64)   0           add_12[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 64, 64, 1)    65          leaky_re_lu_25[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 64, 64, 1)    0           conv2d_14[0][0]
__________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)  (None, 128, 128, 1)  0           activation_3[0][0]
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 128, 128, 64) 0           up_sampling2d_6[0][0]
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 128, 128, 64) 0           lambda_3[0][0]
                                                                 leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 128, 128, 64) 4160        multiply_3[0][0]
__________________________________________________________________________________________________
up_sampling2d_7 (UpSampling2D)  (None, 128, 128, 128 0           leaky_re_lu_23[0][0]
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 128, 128, 64) 256         conv2d_15[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 128, 128, 192 0           up_sampling2d_7[0][0]
                                                                 batch_normalization_34[0][0]
__________________________________________________________________________________________________
conv10a (Conv2D)                (None, 128, 128, 64) 110592      concatenate_3[0][0]
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 128, 128, 64) 256         conv10a[0][0]
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (None, 128, 128, 64) 0           batch_normalization_35[0][0]
__________________________________________________________________________________________________
conv10b (Conv2D)                (None, 128, 128, 64) 12288       concatenate_3[0][0]
__________________________________________________________________________________________________
conv10c (Conv2D)                (None, 128, 128, 64) 36864       leaky_re_lu_26[0][0]
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 128, 128, 64) 256         conv10b[0][0]
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 128, 128, 64) 256         conv10c[0][0]
__________________________________________________________________________________________________
add_13 (Add)                    (None, 128, 128, 64) 0           batch_normalization_37[0][0]
                                                                 batch_normalization_36[0][0]
__________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)      (None, 128, 128, 64) 0           add_13[0][0]
__________________________________________________________________________________________________
gating_num5 (Conv2D)            (None, 128, 128, 32) 2048        leaky_re_lu_27[0][0]
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 128, 128, 32) 128         gating_num5[0][0]
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (None, 128, 128, 32) 0           batch_normalization_38[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 128, 128, 32) 1056        leaky_re_lu_28[0][0]
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 128, 128, 32) 9248        conv2d_17[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 128, 128, 32) 4128        leaky_re_lu_1[0][0]
__________________________________________________________________________________________________
add_14 (Add)                    (None, 128, 128, 32) 0           conv2d_transpose_4[0][0]
                                                                 conv2d_16[0][0]
__________________________________________________________________________________________________
leaky_re_lu_29 (LeakyReLU)      (None, 128, 128, 32) 0           add_14[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 128, 128, 1)  33          leaky_re_lu_29[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 128, 128, 1)  0           conv2d_18[0][0]
__________________________________________________________________________________________________
up_sampling2d_8 (UpSampling2D)  (None, 256, 256, 1)  0           activation_4[0][0]
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 256, 256, 32) 0           up_sampling2d_8[0][0]
__________________________________________________________________________________________________
multiply_4 (Multiply)           (None, 256, 256, 32) 0           lambda_4[0][0]
                                                                 leaky_re_lu_1[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 256, 256, 32) 1056        multiply_4[0][0]
__________________________________________________________________________________________________
up_sampling2d_9 (UpSampling2D)  (None, 256, 256, 64) 0           leaky_re_lu_27[0][0]
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 256, 256, 32) 128         conv2d_19[0][0]
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 256, 256, 96) 0           up_sampling2d_9[0][0]
                                                                 batch_normalization_39[0][0]
__________________________________________________________________________________________________
conv11a (Conv2D)                (None, 256, 256, 32) 27648       concatenate_4[0][0]
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 256, 256, 32) 128         conv11a[0][0]
__________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)      (None, 256, 256, 32) 0           batch_normalization_40[0][0]
__________________________________________________________________________________________________
conv11b (Conv2D)                (None, 256, 256, 32) 3072        concatenate_4[0][0]
__________________________________________________________________________________________________
conv11c (Conv2D)                (None, 256, 256, 32) 9216        leaky_re_lu_30[0][0]
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 256, 256, 32) 128         conv11b[0][0]
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 256, 256, 32) 128         conv11c[0][0]
__________________________________________________________________________________________________
add_15 (Add)                    (None, 256, 256, 32) 0           batch_normalization_42[0][0]
                                                                 batch_normalization_41[0][0]
__________________________________________________________________________________________________
leaky_re_lu_31 (LeakyReLU)      (None, 256, 256, 32) 0           add_15[0][0]
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 256, 256, 16) 4608        leaky_re_lu_31[0][0]
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 256, 256, 16) 64          conv2d_20[0][0]
__________________________________________________________________________________________________
leaky_re_lu_32 (LeakyReLU)      (None, 256, 256, 16) 0           batch_normalization_43[0][0]
__________________________________________________________________________________________________
Output (Dense)                  (None, 256, 256, 2)  34          leaky_re_lu_32[0][0]
==================================================================================================
Total params: 39,172,487
Trainable params: 39,150,439
Non-trainable params: 22,048
__________________________________________________________________________________________________
split value 1356